//
//  main.c
//  进制转换
//
//  Created by qianfeng on 14-7-15.
//  Copyright (c) 2014年 zhang. All rights reserved.
//

#include <stdio.h>
//----------------------------------进制转换-------------------------
//十进制
//0 1 2 3 4 5 6 7 8 9 10 11 12 .... 99 100 101 ... 999 1000
// 10^(n-1)

//高电平 表示1 低电平表示 0
//二进制: 0 1

//机器语言
//5+6
//101001010100101001
//101001010101010010
//101010010101001010

//汇编语言
//5+6
//movl $5 -8(rbp)
//movl $6 -12(rbp)
//movl -8(rbp) %eax
//addl -12(rbp) %eax
//movl %eax %esi
//汇编器
// 汇编语言 --> 二进制
//C语言
// 5+6
// int a = 5;
// int b = 6;
// int c = a+b;

//C语言的特点: 简洁 可读性好 可移植性强,无平台限制

//C语言 --> 汇编语言 ---> 二进制

//12345 求除10余数,到0结束,倒序取余数
//12345   / 10   -- 5   5*10^0
//1234    / 10   -- 4   4*10^1
//123     / 10   -- 3   3*10^2
//12      / 10   -- 2   2*10^3
//1       / 10   -- 1   1*10^4
//0       / 10   -- 0
//
//12345 = 12345 = 1*10^4 + 2*10^3 + 3*10^2 + 4*10^1 + 5*10^0= 12345

//0b:二进制的前缀
//123 除2倒序取余数
//123  / 2   --- 1
//61   / 2   --- 1
//30   / 2   --- 0
//15   / 2   --- 1
//7    / 2   --- 1
//3    / 2   --- 1
//1    / 2   --- 1
//0

//123 = 0b1111011 = 1*2^0 + 1*2^1 + 0 + 1*2^3 + 1*2^4 + 1*2^5 +1*2^6 = 1 + 2 + 0 + 8 + 16 + 32 + 64 = 123
//96 234 78 49 278
//运行程序: command + R

/*int main(int argc, const char * argv[])
{
    int bin[32];
    int i =0 ;
    int a;
    scanf("%d", &a);
    while (a) {
        bin[i] = a%2;
        a/=2;
        i++;
    }
    for (i= i-1; i>=0; i--) {
        printf("%d", bin[i]);
    }
    printf("\n");
    return 0;
}*/
// 0 1 10 11 100 101 110 111 1000 1001 1010 1011 1100 1101 1110 1111
// 0 ~ 15
//逢二进一

//八进制  逢八进一
//前缀加0表示八进制数
//除八倒序取余数
// 0 1 2 3 4 5 6 7
// 10 11 12 13 ...
// 96
// 96    / 8   --- 0
// 12    / 8   --- 4
// 1     / 8   --- 1
// 0
//96  = 0140

//123 456 58 47
//contrl + i: 排序程序
/*int main(int argc, const char * argv[])
{
    int arr[32];
    int i =0 ;
    int a;
    scanf("%d", &a);
    while (a) {
        arr[i] = a%8;
        a/=8;
        i++;
    }
    for (i= i-1; i>=0; i--) {
        printf("%d", arr[i]);
    }
    printf("\n");
    return 0;
}*/
// 0173
// 0    1    2     3    4    5    6    7
//000   001  010   011  100  101  110  111
// 0173 = 1111011
//"421" 规则
//
//011 010 101 010 100 100 111 101 010 101 010
//032524475252
//二进制转8进制 :
//从低位开始, 每三位为一组, 高位不足三位补0, 然后用一位八进制数代替三位二进制数
//111 110 100 101 010 101 010 011 101 100 101
//076452523545
//逢十六进一
//十进制数转十六进制
//除十六倒序取余数
//0x: 十六进制数的前缀
//十六进制:0 1 2 3 4 5 6 7 8 9 a/A b/B c/C d/D e/E f/F
//e f 10 11 ..... 1f 20 ......a0 .....af b0 .....
//123
//123   /   16   ---   b
//7     /   16   ----  7
//0

// 123 = 0x7b
//345 96 128 77
/*int main(int argc, const char * argv[])
{
    int arr[32];
    int i =0 ;
    int a;
    scanf("%d", &a);
    while (a) {
        arr[i] = a%16;
        a/=16;
        i++;
    }
    for (i= i-1; i>=0; i--) {
        printf("%x", arr[i]);
    }
    printf("\n");
    return 0;
}*/
//0x14
//0      1      2     3     4     5     6      7
//0000   0001   0010  0011  0100  0101  0110  0111
// 8      9     a       b      c      d     e       f
// 1000   1001  1010    1011   1100   1101  1110    1111
//"8421"
// 0x14
// 0x14 = 10100 = 2^4 + 2^2 = 20
//十六进制转二进制
//把十六进制中的每一位,分别用四位二进制表示
//0x45  0x96 0xab  0x78
//0x45 = 1000101
//0x96 = 10010110
//0xab = 10101011
//0x78 = 1111000

//0100 1011 0110 1101 0101 0010 1010 0101
//0x4b6d52a5
//二进制转十六进制:
//从低位开始,每四位为一组,高位不足四位补0, 用十六进制的数字代替四位二进制数
//0001 0111 1010 1100 1101 0101 0100 1010 1010 1111 1111
//0x17acd54aaff

//http://192.168.88.253/1408/
